<?xml version="1.0" ?>
<net name="model-0000" version="11">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data shape="1,3,112,112" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="data,data:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_8959" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="0" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_mul_8959"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="_mulscalar0/lin_/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="_mulscalar0/lin_/Fused_Mul_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_8961" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="4" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_8961"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="_minusscalar0/lin_/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="_minusscalar0/lin_/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="_mulscalar0:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv_1_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 3, 3, 3" offset="8" size="6912"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv_1_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="conv_1_conv2d_weight:0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv_1_conv2d" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv_1_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_89648969" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="6920" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_89648969"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv_1_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv_1_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv_1_batchnorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv_1_relu_gamma" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="7176" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv_1_relu_gamma"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="conv_1_relu_gamma:0">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv_1_relu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="conv_1_relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv_1_relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv_2_dw_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 3, 3" offset="7432" size="2304"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv_2_dw_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="conv_2_dw_conv2d_weight:0">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv_2_dw_conv2d" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv_2_dw_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_89728977" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="9736" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_89728977"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv_2_dw_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv_2_dw_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv_2_dw_batchnorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv_2_dw_relu_gamma" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="9992" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="conv_2_dw_relu_gamma"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="conv_2_dw_relu_gamma:0">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv_2_dw_relu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="conv_2_dw_relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv_2_dw_relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="dconv_23_conv_sep_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 1, 1" offset="10248" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_sep_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="dconv_23_conv_sep_conv2d_weight:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="dconv_23_conv_sep_conv2d" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_sep_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_89808985" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="43016" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_89808985"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="dconv_23_conv_sep_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_sep_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dconv_23_conv_sep_batchnorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="dconv_23_conv_sep_relu_gamma" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="43528" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_sep_relu_gamma"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="dconv_23_conv_sep_relu_gamma:0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="dconv_23_conv_sep_relu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_sep_relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dconv_23_conv_sep_relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="dconv_23_conv_dw_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 1, 1, 3, 3" offset="44040" size="4608"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_dw_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="dconv_23_conv_dw_conv2d_weight:0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="dconv_23_conv_dw_conv2d" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_dw_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_add_89888993" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="48648" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_89888993"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="dconv_23_conv_dw_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_dw_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dconv_23_conv_dw_batchnorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="dconv_23_conv_dw_relu_gamma" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="49160" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_dw_relu_gamma"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="dconv_23_conv_dw_relu_gamma:0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="dconv_23_conv_dw_relu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_dw_relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dconv_23_conv_dw_relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="dconv_23_conv_proj_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 128, 1, 1" offset="49672" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_proj_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="dconv_23_conv_proj_conv2d_weight:0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="dconv_23_conv_proj_conv2d" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_proj_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_89969001" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="82440" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_89969001"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="dconv_23_conv_proj_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="dconv_23_conv_proj_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="dconv_23_conv_proj_batchnorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="res_3_block0_conv_sep_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 1, 1" offset="82696" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_sep_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block0_conv_sep_conv2d_weight:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="res_3_block0_conv_sep_conv2d" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_sep_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="data_add_90049009" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="115464" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90049009"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="res_3_block0_conv_sep_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_sep_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block0_conv_sep_batchnorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="res_3_block0_conv_sep_relu_gamma" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="115976" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_sep_relu_gamma"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block0_conv_sep_relu_gamma:0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="res_3_block0_conv_sep_relu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_sep_relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block0_conv_sep_relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="res_3_block0_conv_dw_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 1, 1, 3, 3" offset="116488" size="4608"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_dw_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block0_conv_dw_conv2d_weight:0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="res_3_block0_conv_dw_conv2d" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_dw_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="data_add_90129017" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="121096" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90129017"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="res_3_block0_conv_dw_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_dw_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block0_conv_dw_batchnorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="res_3_block0_conv_dw_relu_gamma" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="121608" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_dw_relu_gamma"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block0_conv_dw_relu_gamma:0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="res_3_block0_conv_dw_relu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_dw_relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block0_conv_dw_relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="res_3_block0_conv_proj_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 128, 1, 1" offset="122120" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_proj_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block0_conv_proj_conv2d_weight:0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="res_3_block0_conv_proj_conv2d" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_proj_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="data_add_90209025" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="154888" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90209025"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="res_3_block0_conv_proj_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block0_conv_proj_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block0_conv_proj_batchnorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="_plus0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="_plus0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="_plus0:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="res_3_block1_conv_sep_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 1, 1" offset="155144" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_sep_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block1_conv_sep_conv2d_weight:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="res_3_block1_conv_sep_conv2d" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_sep_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="data_add_90289033" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="187912" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90289033"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="res_3_block1_conv_sep_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_sep_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block1_conv_sep_batchnorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="res_3_block1_conv_sep_relu_gamma" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="188424" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_sep_relu_gamma"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block1_conv_sep_relu_gamma:0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="res_3_block1_conv_sep_relu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_sep_relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block1_conv_sep_relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="res_3_block1_conv_dw_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 1, 1, 3, 3" offset="188936" size="4608"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_dw_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block1_conv_dw_conv2d_weight:0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="res_3_block1_conv_dw_conv2d" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_dw_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="data_add_90369041" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="193544" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90369041"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="res_3_block1_conv_dw_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_dw_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block1_conv_dw_batchnorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="res_3_block1_conv_dw_relu_gamma" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="194056" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_dw_relu_gamma"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block1_conv_dw_relu_gamma:0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="res_3_block1_conv_dw_relu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_dw_relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block1_conv_dw_relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="res_3_block1_conv_proj_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 128, 1, 1" offset="194568" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_proj_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block1_conv_proj_conv2d_weight:0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="res_3_block1_conv_proj_conv2d" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_proj_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="data_add_90449049" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="227336" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90449049"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="res_3_block1_conv_proj_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block1_conv_proj_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block1_conv_proj_batchnorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="_plus1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="_plus1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="_plus1:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="res_3_block2_conv_sep_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 1, 1" offset="227592" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_sep_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block2_conv_sep_conv2d_weight:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="res_3_block2_conv_sep_conv2d" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_sep_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="data_add_90529057" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="260360" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90529057"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="res_3_block2_conv_sep_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_sep_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block2_conv_sep_batchnorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="res_3_block2_conv_sep_relu_gamma" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="260872" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_sep_relu_gamma"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block2_conv_sep_relu_gamma:0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="res_3_block2_conv_sep_relu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_sep_relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block2_conv_sep_relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="res_3_block2_conv_dw_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 1, 1, 3, 3" offset="261384" size="4608"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_dw_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block2_conv_dw_conv2d_weight:0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="res_3_block2_conv_dw_conv2d" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_dw_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_90609065" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="265992" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90609065"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="res_3_block2_conv_dw_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_dw_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block2_conv_dw_batchnorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="res_3_block2_conv_dw_relu_gamma" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="266504" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_dw_relu_gamma"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block2_conv_dw_relu_gamma:0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="res_3_block2_conv_dw_relu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_dw_relu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block2_conv_dw_relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="res_3_block2_conv_proj_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 128, 1, 1" offset="267016" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_proj_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block2_conv_proj_conv2d_weight:0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="res_3_block2_conv_proj_conv2d" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_proj_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_90689073" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="299784" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90689073"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="res_3_block2_conv_proj_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block2_conv_proj_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="res_3_block2_conv_proj_batchnorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="_plus2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="_plus2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="_plus2:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="res_3_block3_conv_sep_batchnorm/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 1, 1" offset="300040" size="32768"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block3_conv_sep_batchnorm/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="res_3_block3_conv_sep_conv2d_weight:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="res_3_block3_conv_sep_conv2d" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block3_conv_sep_conv2d"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="data_add_90769081" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="332808" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_90769081"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="res_3_block3_conv_sep_batchnorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="res_3_block3_conv_sep_batchnorm/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
